<!-- dflook/terraform-github-actions {"workspace":"auto-vars","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e71707a8946e80c1f9fd642bd9707560ccf550771e852f65c697408fa41c08b7","plan_job_ref":"Job Test actions using target and replace #495 at https://github.com/dflook/terraform-github-actions/actions/runs/15328191072","plan_hash":"07412a2b5b15e00a681415691ceeac8adbe802f0330f22682e039e11717bafac","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __auto-vars__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "5t5QDDG6ql" -> (known after apply)
!~  foreach = "owZvcxDwqK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #495](https://github.com/dflook/terraform-github-actions/actions/runs/15328191072)